app/Controllers/Siswa.php

    public function data_kelas()
    {
        $data = array(
            'session' => \Config\Services::session(),
            'kelas' => $this->MKelas->select('t_kelas.*, t_akun_admin.NamaLengkap')->join('t_akun_admin', 't_akun_admin.IDAkunAdmin = t_kelas.IDAkunAdmin', 'left')->orderBy('Kelas', 'ASC')->findAll(),
        );
---
SELECT `t_kelas`.*, `t_akun_admin`.`NamaLengkap`
FROM `t_kelas`
LEFT JOIN `t_akun_admin` ON `t_akun_admin`.`IDAkunAdmin` = `t_kelas`.`IDAkunAdmin`
ORDER BY `Kelas` ASC

    public function data_tahun_ajaran()
    {
        $data = array(
            'session' => \Config\Services::session(),
            'kelas' => $this->MTahunAjaran->select('t_tahun_ajaran.*, t_akun_admin.NamaLengkap')->join('t_akun_admin', 't_akun_admin.IDAkunAdmin = t_tahun_ajaran.IDAkunAdmin', 'left')->orderBy('TahunAjaran', 'ASC')->findAll(),
        );
---
SELECT `t_tahun_ajaran`.*, `t_akun_admin`.`NamaLengkap`
FROM `t_tahun_ajaran`
LEFT JOIN `t_akun_admin` ON `t_akun_admin`.`IDAkunAdmin` = `t_tahun_ajaran`.`IDAkunAdmin`
ORDER BY `TahunAjaran` ASC