app/Controllers/Siswa.php

    public function data_siswa()
    {
        $data = array(
            'session' => \Config\Services::session(),
            'siswa' => $this->MSiswa->join('t_kelas', 't_kelas.IDKelas = t_siswa.IDKelas', 'left')->join('t_jurusan', 't_jurusan.IDJurusan = t_siswa.IDJurusan', 'left')->orderBy('NISN', 'ASC')->findAll()
        );
---
SELECT *
FROM `t_siswa`
LEFT JOIN `t_kelas` ON `t_kelas`.`IDKelas` = `t_siswa`.`IDKelas`
LEFT JOIN `t_jurusan` ON `t_jurusan`.`IDJurusan` = `t_siswa`.`IDJurusan`
ORDER BY `NISN` ASC

    public function form_siswa($parameter = null, $nisn = null)
    {
        if (decrypt_url($parameter) == 'Tambah') {
            $status_form = 'Tambah';
        } elseif (decrypt_url($parameter) == 'Perbarui') {
            $status_form = 'Perbarui';
        } else {
            return redirect()->to(site_url('siswa/data_siswa'));
        }
        $data = array(
            'session' => \Config\Services::session(),
            'status_form' => $status_form,
            'kelas' => $this->MKelas->orderBy('Kelas', 'ASC')->findAll(),
            'jurusan' => $this->MJurusan->orderBy('Jurusan', 'ASC')->findAll(),
            'tahun_ajaran' => $this->MTahunAjaran->orderBy('TahunAjaran', 'ASC')->findAll()
        );
---
SELECT *
FROM `t_kelas`
ORDER BY `Kelas` ASC
SELECT *
FROM `t_jurusan`
ORDER BY `Jurusan` ASC
SELECT *
FROM `t_tahun_ajaran`
ORDER BY `TahunAjaran` ASC

    public function data_kelas()
    {
        $data = array(
            'session' => \Config\Services::session(),
            'kelas' => $this->MKelas->select('t_kelas.*, t_akun_admin.NamaLengkap')->join('t_akun_admin', 't_akun_admin.IDAkunAdmin = t_kelas.IDAkunAdmin', 'left')->orderBy('Kelas', 'ASC')->findAll(),
        );
---
SELECT `t_kelas`.*, `t_akun_admin`.`NamaLengkap`
FROM `t_kelas`
LEFT JOIN `t_akun_admin` ON `t_akun_admin`.`IDAkunAdmin` = `t_kelas`.`IDAkunAdmin`
ORDER BY `Kelas` ASC

    public function data_jurusan()
    {
        $data = array(
            'session' => \Config\Services::session(),
            'kelas' => $this->MJurusan->select('t_jurusan.*, t_akun_admin.NamaLengkap')->join('t_akun_admin', 't_akun_admin.IDAkunAdmin = t_jurusan.IDAkunAdmin', 'left')->orderBy('Jurusan', 'ASC')->findAll(),
        );
---
SELECT `t_jurusan`.*, `t_akun_admin`.`NamaLengkap`
FROM `t_jurusan`
LEFT JOIN `t_akun_admin` ON `t_akun_admin`.`IDAkunAdmin` = `t_jurusan`.`IDAkunAdmin`
ORDER BY `Jurusan` ASC

    public function hapus_jurusan($idjurusan = null)
    {
        $parameters = array('IDJurusan' => decrypt_url($idjurusan));
        $SQL = $this->MJurusan->delete($parameters);
---
DELETE FROM `t_jurusan`
WHERE `IDJurusan` IN ('J291938161')